import matplotlib.pyplot as plt
import numpy as np

x = [0.01, 0.05/2, 0.05, 0.1]
y = [0.9401084598698482, 0.6334056399132321, 0.5986984815618221, 0.5792]
x1 =[0.01, 0.05/2, 0.05, 0.1]
y1 = [0.9609544468546638, 0.93058568329718, 0.6203904555314533, 0.6117136659436009]
x2 =[0.01, 0.05/2, 0.05, 0.1]
y2 = [0.8972972972972973, 0.9457700650759219, 0.6117136659436009, 0.6203904555314533]
plt.plot(x, y, label='RMSprop')
plt.plot(x1, y1, label='Adam')
plt.plot(x2, y2, label='SGD')

# y = [0.9875, 0.9751, 0.9623, 0.8600]
#
# y1 = [0.9875, 0.9751, 0.9623, 0.8600]

plt.ylabel('Средняя точность')
plt.xlabel('Скорость обучения')
plt.title('Зависимость средней точности от скорости обучения')
plt.legend()
plt.show()